Hi @Parahandy  thank you for creating this issue and thanks for your words.  I tested on 6.2.4

```
# cat maintst.tf
provider "fortios" {
  hostname = "192.168.52.177"
  token = "twHgtmQn30gps41388dds8m3drc3rw"
  insecure = "true"
}

resource "fortios_router_static" "trname" {
  device = "port4"
  dst    = "1.0.0.0 255.240.0.0"
}

# terraform plan
2020/09/16 22:51:42 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fortios_router_static.trname will be created
  + resource "fortios_router_static" "trname" {
      + bfd                     = (known after apply)
      + blackhole               = (known after apply)
      + device                  = "port4"
      + distance                = (known after apply)
      + dst                     = "1.0.0.0 255.240.0.0"
      + dstaddr                 = (known after apply)
      + dynamic_gateway         = (known after apply)
      + gateway                 = (known after apply)
      + id                      = (known after apply)
      + internet_service        = (known after apply)
      + internet_service_custom = (known after apply)
      + link_monitor_exempt     = (known after apply)
      + priority                = (known after apply)
      + seq_num                 = (known after apply)
      + src                     = (known after apply)
      + status                  = (known after apply)
      + virtual_wan_link        = (known after apply)
      + vrf                     = (known after apply)
      + weight                  = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

# terraform apply
2020/09/16 22:51:47 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fortios_router_static.trname will be created
  + resource "fortios_router_static" "trname" {
      + bfd                     = (known after apply)
      + blackhole               = (known after apply)
      + device                  = "port4"
      + distance                = (known after apply)
      + dst                     = "1.0.0.0 255.240.0.0"
      + dstaddr                 = (known after apply)
      + dynamic_gateway         = (known after apply)
      + gateway                 = (known after apply)
      + id                      = (known after apply)
      + internet_service        = (known after apply)
      + internet_service_custom = (known after apply)
      + link_monitor_exempt     = (known after apply)
      + priority                = (known after apply)
      + seq_num                 = (known after apply)
      + src                     = (known after apply)
      + status                  = (known after apply)
      + virtual_wan_link        = (known after apply)
      + vrf                     = (known after apply)
      + weight                  = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fortios_router_static.trname: Creating...
fortios_router_static.trname: Creation complete after 0s [id=2]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
root@sv:/work/zamba/03fos-gen/03Terraform/bin#

```
But I was not able to reproduce,  can you please post your configuration? Thank you!



